chipskiller/ahrs_test/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/Template/main.c
#include "main.h"
#include "communicate_protocol.h"
#include "gd32f3x0.h"
#include "math.h"
#include "stdio.h"
#include "string.h"
#include "systick.h"
#include <stdint.h>

#define delay_ms(x) delay_1ms(x)

/************************ 宏定义区域 ************************/
// I2C设备7位地址
#define ICM42670_ADDR 0x68
#define QMC5883P_ADDR 0x2c

#define I2C_IMU I2C0       // ICM42670挂载I2C0 (PA0/PA1)
#define I2C_MAG I2C0       // 磁力计挂载I2C0
#define USART_RS485 USART1 // RS485上报串口
#define I2C_TIMEOUT 10000U // I2C通信超时计数

// Flash参数存储分区（GD32F330 Flash每页1024字节，使用末尾3页）
#define FLASH_PAGE_SIZE 1024U
#define FLASH_ZONE_A 0x0800FC00U    // 姿态基准备份A
#define FLASH_ZONE_B 0x0800FD00U    // 姿态基准备份B
#define FLASH_GYRO_BIAS 0x0800FE00U // 陀螺温度零偏存储区

// 采样与报警配置
#define DT 0.01f                    // 10ms采样周期 100Hz
#define ANGLE_ALARM_THRESHOLD 10.0f // 角度偏移报警阈值10°
#define ALARM_FILTER_CNT 200U       // 2s防抖帧数(200*10ms)
#define MAG_DISTURB_THRESH 120.0f   // 地磁突变判定阈值

/************************ 全局数据结构体 ************************/
// IMU原始传感器数据
typedef struct {
  float ax;   // X轴加速度 g
  float ay;   // Y轴加速度 g
  float az;   // Z轴加速度 g
  float gx;   // X轴角速度 °/s
  float gy;   // Y轴角速度 °/s
  float gz;   // Z轴角速度 °/s
  float temp; // 芯片温度 ℃
} icm_raw_data_t;

// 磁力计原始数据
typedef struct {
  float mx;
  float my;
  float mz;
  float mag_norm; // 地磁模长，用于判断干扰
} mag_raw_data_t;

// 姿态结构体：实时角度 + 安装标定基准零点
typedef struct {
  float w, x, y, z;
} quaternion_t;

// typedef struct {
//   float pitch;      // 实时俯仰角 X轴
//   float roll;       // 实时横滚角 Y轴
//   float yaw_now;    // 实时旋转角 Z轴(绕灯杆)
//   float pitch_base; // 安装基准俯仰零点
//   float roll_base;  // 安装基准横滚零点
//   float yaw_base;   // 安装基准旋转零点
// } attitude_info_t;

// 陀螺温度补偿零偏参数
typedef struct {
  float gz_bias;  // Z轴陀螺静态零偏
  float temp_ref; // 标定时基准温度
} gyro_bias_t;

// 全局变量
icm_raw_data_t icm_raw;
mag_raw_data_t mag_raw;
attitude_info_t att;
gyro_bias_t gyro_bias;
quaternion_t quat;

uint8_t day_mode = 1;                 // 1=白天6轴模式 0=夜间9轴融合
uint8_t mag_disturb_flag = 0;         // 地磁受大车干扰标记
static uint16_t alarm_filter_cnt = 0; // 报警防抖计数器
uint32_t stable_cnt;
volatile uint8_t imu_loop_flag = 0; // 定时器中断标志

#define ARRAYNUM(arr_nanme) (uint32_t)(sizeof(arr_nanme) / sizeof(*(arr_nanme)))
#define TRANSMIT_SIZE (ARRAYNUM(transmitter_buffer) - 1)

uint8_t transmitter_buffer[128] = "\n\rUSART interrupt test\n\r";
uint8_t receiver_buffer[32];
uint8_t transfersize = TRANSMIT_SIZE;
uint8_t receivesize = 32;
__IO uint8_t txcount = 0;
__IO uint16_t rxcount = 0;

/************************ USART0 DMA + 空闲中断接收 ************************/
#define USART0_RX_BUF_SIZE 256U
uint8_t usart0_rx_buffer[USART0_RX_BUF_SIZE];
volatile uint16_t usart0_rx_len = 0;
volatile uint8_t usart0_rx_flag = 0;

/************************ 底层I2C通用读写函数 ************************/
void soft_i2c_init(void);
void soft_i2c_start(void);
void soft_i2c_stop(void);
uint8_t soft_i2c_send_byte(uint8_t byte);
uint8_t soft_i2c_read_byte(uint8_t ack);

/**
 * @brief I2C读取单个寄存器
 * @param i2c_periph:I2C外设 I2C0/I2C1
 * @param dev_addr:设备7位地址
 * @param reg:寄存器地址
 * @retval 读取到的寄存器数值
 */
uint8_t i2c_reg_read(uint32_t i2c_periph, uint8_t dev_addr, uint8_t reg) {
  soft_i2c_start();
  soft_i2c_send_byte((dev_addr << 1) | 0);
  soft_i2c_send_byte(reg);
  soft_i2c_start();
  soft_i2c_send_byte((dev_addr << 1) | 1);
  uint8_t data = soft_i2c_read_byte(0);
  soft_i2c_stop();
  return data;
}

/**
 * @brief I2C单寄存器写入
 */
void i2c_reg_write(uint32_t i2c_periph, uint8_t dev_addr, uint8_t reg,
                   uint8_t data) {
  soft_i2c_start();
  soft_i2c_send_byte((dev_addr << 1) | 0);
  soft_i2c_send_byte(reg);
  soft_i2c_send_byte(data);
  soft_i2c_stop();
}

/**
 * @brief I2C连续批量读取多字节
 */
void i2c_reg_read_multi(uint32_t i2c_periph, uint8_t dev_addr, uint8_t reg,
                        uint8_t *buf, uint16_t len) {
  soft_i2c_start();
  soft_i2c_send_byte((dev_addr << 1) | 0);
  soft_i2c_send_byte(reg);
  soft_i2c_start();
  soft_i2c_send_byte((dev_addr << 1) | 1);

  for (uint16_t i = 0; i < len; i++) {
    buf[i] = soft_i2c_read_byte((i < len - 1) ? 1 : 0);
  }

  soft_i2c_stop();
}

/************************ ICM42670 驱动函数 ************************/
/**
 * @brief ICM42670芯片初始化
 */
void icm42670_init(void) {
  uint8_t who_am_i;

  who_am_i = i2c_reg_read(I2C_IMU, ICM42670_ADDR, 0x75);

  if (who_am_i != 0x67) {
    return;
  }

  i2c_reg_write(I2C_IMU, ICM42670_ADDR, 0x1F, 0x00);
  delay_ms(100);

  i2c_reg_write(I2C_IMU, ICM42670_ADDR, 0x1F, 0x0F);
  delay_ms(30);

  i2c_reg_write(I2C_IMU, ICM42670_ADDR, 0x21, 0x68);
  i2c_reg_write(I2C_IMU, ICM42670_ADDR, 0x20, 0x68);
}

/**
 * @brief 读取IMU全部原始数据并转换物理量
 */
void icm42670_get_raw_data(void) {
  uint8_t buf[12] = {0};
  i2c_reg_read_multi(I2C_IMU, ICM42670_ADDR, 0x0B, buf, 12);

  int16_t ax_raw = (buf[0] << 8) | buf[1];
  int16_t ay_raw = (buf[2] << 8) | buf[3];
  int16_t az_raw = (buf[4] << 8) | buf[5];
  icm_raw.ax = ax_raw / 16384.0f;
  icm_raw.ay = ay_raw / 16384.0f;
  icm_raw.az = az_raw / 16384.0f;

  int16_t gx_raw = (buf[6] << 8) | buf[7];
  int16_t gy_raw = (buf[8] << 8) | buf[9];
  int16_t gz_raw = (buf[10] << 8) | buf[11];
  icm_raw.gx = gx_raw / 131.072f;
  icm_raw.gy = gy_raw / 131.072f;
  icm_raw.gz = gz_raw / 131.072f;

  uint8_t temp_buf[2] = {0};
  i2c_reg_read_multi(I2C_IMU, ICM42670_ADDR, 0x09, temp_buf, 2);
  int16_t temp_raw = (temp_buf[0] << 8) | temp_buf[1];
  icm_raw.temp = temp_raw / 132.48f + 25.0f;
}

/************************ QMC5883P 磁力计驱动 ************************/
void qmc5883p_init(void) {
  i2c_reg_write(I2C_MAG, QMC5883P_ADDR, 0x09, 0x1D); // 连续采样、8倍增益、100Hz
  i2c_reg_write(I2C_MAG, QMC5883P_ADDR, 0x0A, 0x00);
}

/**
 * @brief 读取磁力计原始数据，计算地磁模长
 */
void qmc5883p_get_raw_data(void) {
  uint8_t buf[6] = {0};
  i2c_reg_read_multi(I2C_MAG, QMC5883P_ADDR, 0x00, buf, 6);
  int16_t mx_raw = (buf[1] << 8) | buf[0];
  int16_t my_raw = (buf[3] << 8) | buf[2];
  int16_t mz_raw = (buf[5] << 8) | buf[4];

  mag_raw.mx = mx_raw;
  mag_raw.my = my_raw;
  mag_raw.mz = mz_raw;
  mag_raw.mag_norm = sqrtf(mag_raw.mx * mag_raw.mx + mag_raw.my * mag_raw.my +
                           mag_raw.mz * mag_raw.mz);
}

/**
 * @brief 判断地磁是否被大车金属干扰
 */
void mag_disturb_detect(void) {
  static float last_norm = 0;
  float delta = fabsf(mag_raw.mag_norm - last_norm);
  last_norm = mag_raw.mag_norm;
  mag_disturb_flag = (delta > MAG_DISTURB_THRESH) ? 1 : 0;
}

